#include <bits/stdc++.h>
// 현재 페이지 : 274
using namespace std;

#pragma region Chapter 00.템플릿

#pragma endregion

#pragma region 1.0 템플릿
/*



*/
#pragma endregion

//-------------------------------------------------------------------------------------------------//



#pragma region 질문 리스트
/*
1장 : 
    1. C++ 에서 빌드는 어떻게 이루어지는가?
    2. 런타임, 컴파일 타임?
    3. 스택과 힙
    4. 스마트 포인터
    5. 참조 전달 방식
    6. const 참조 전달 방식
    7. 예외 처리
    8. 타입 추론 auto
    9. decltype
    10. 생성자 이니셜라이저
    11. 유니폼 초기화

2장 :
    1. 스트링 리터럴
    2. 로 스트링 리터럴
    3. 메모리 영역(코드, 데이터, 스택, 힙)
    4. string_view

3장 :
    1. 주석 작성법

4장 :
    1. 추상화
    2. 재사용
    3. 빅-오 표기법

5장 :
    1. has-a 관계, is-a 관계
    2. 다형성과 코드 재사용
    3. 상속
    4. 믹스인 클래스
    5. 인터페이스

6장 :
    1. 응집도 / 결합도
    2. 템플릿
    3. 개방/폐쇄 원칙, 그리고 상속
    4. SOLID 원칙

7장 :
    1. 메모리 할당 / 스택과 힙
    2. 메모리 누수
    3. malloc() 과 new 그리고 realloc()
    4. 힙 영역의 배열 할당
    5. 포인터의 타입캐스팅
    6. 포인터 연산
    7. 가비지 컬렉션
    8. unique_ptr
    9. shared_ptr
    
*/
#pragma endregion




//-------------------------------------------------------------------------------------------------//

int main()
{
    std::cout << "Hello World!\n";
    
}

